app/controllers/products_controller.rb

  def index
   @products = Product.all
   @order_item = current_order.order_items.new
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 6]]